In [8]:
import pandas as pd

# Sample DataFrames
df1 = pd.DataFrame({'A': [1, 2], 'B': [3, 4]})
df2 = pd.DataFrame({'A': [5, 6], 'B': [7, 8]})

In [9]:
df1

   A  B
0  1  3
1  2  4

In [10]:
df2

   A  B
0  5  7
1  6  8

In [11]:
df = pd.concat([df1, df2], axis=0)
df

   A  B
0  1  3
1  2  4
0  5  7
1  6  8

In [12]:
df = pd.concat([df1, df2], axis=1)
df

   A  B  A  B
0  1  3  5  7
1  2  4  6  8

In [16]:
# index will continue the numbers
df = pd.concat([df1, df2], ignore_index=True)
df

   A  B
0  1  3
1  2  4
2  5  7
3  6  8

In [18]:
# Sample DataFrames with different columns
df3 = pd.DataFrame({'C': [9, 10,11], 'D': [11, 12,13]})

# Concatenate DataFrames with different columns
df = pd.concat([df1, df3], axis=1)
df

     A    B   C   D
0  1.0  3.0   9  11
1  2.0  4.0  10  12
2  NaN  NaN  11  13

In [22]:
# Sample DataFrames with different indexes
df4 = pd.DataFrame({'A': [13, 14], 'B': [15, 16]}, index=[9, 10])

# Concatenate DataFrames with different indexes
df = pd.concat([df1, df4])
df

     A   B
0    1   3
1    2   4
9   13  15
10  14  16